packages/artillery-plugin-publish-metrics/test/config-agent.yaml
config:
  target: https://artillery.io
  phases:
    - duration: 11
      arrivalRate: 1
    - duration: 11
      arrivalRate: 2
  plugins:
    publish-metrics:
      # apiKey not set, so the plugin will assume that the agent is running:
      - type: datadog
        prefix: 'artillery.publish_metrics_plugin.'
        tags:
          - "testId:{{ $processEnvironment.TEST_ID }}"
          - "reporterType:datadog-agent"
        event:
          priority: low
          tags:
            - "testId:{{ $processEnvironment.TEST_ID }}"